name=['Alkesh','Jay','Manali']

name

In [4]:
name=['Alkesh','Jay','Manali']

In [5]:
name

['Alkesh', 'Jay', 'Manali']

In [6]:
marks=[45,54,55]

In [7]:
marks

[45, 54, 55]

In [4]:
import pandas as pd;

In [9]:
df=pd.Series(data=marks)

In [10]:
df

0    45
1    54
2    55
dtype: int64

In [11]:
type(df)

pandas.core.series.Series

In [12]:
daf=pd.Series(data=name)

In [13]:
daf

0    Alkesh
1       Jay
2    Manali
dtype: object

In [17]:
student={'Name':name,'Mark':marks}

In [16]:
type(daf)

pandas.core.series.Series

In [18]:
student

{'Name': ['Alkesh', 'Jay', 'Manali'], 'Mark': [45, 54, 55]}

In [19]:
type(student)

dict

In [20]:
data=pd.Series(data=student)

In [21]:
data

Name    [Alkesh, Jay, Manali]
Mark             [45, 54, 55]
dtype: object

In [22]:
dataframe=pd.DataFrame(data=student)

In [23]:
dataframe

     Name  Mark
0  Alkesh    45
1     Jay    54
2  Manali    55

In [25]:
dataframe=pd.DataFrame(data=student,index=['A','B','C'])

In [26]:
dataframe

     Name  Mark
A  Alkesh    45
B     Jay    54
C  Manali    55

In [27]:
dataframe.shape

(3, 2)

In [28]:
dataframe.info

<bound method DataFrame.info of      Name  Mark
A  Alkesh    45
B     Jay    54
C  Manali    55>

In [29]:
dataframe.describe

<bound method NDFrame.describe of      Name  Mark
A  Alkesh    45
B     Jay    54
C  Manali    55>

In [32]:
dataframe.head()

     Name  Mark
A  Alkesh    45
B     Jay    54
C  Manali    55

In [33]:
dataframe.head(2)

     Name  Mark
A  Alkesh    45
B     Jay    54

In [35]:
dataframe.tail(2)

     Name  Mark
B     Jay    54
C  Manali    55

In [5]:
df=pd.read_csv('Ja.csv')
df

   Name  Age  Marks
0     a   22     34
1     b   23     35
2     c   21     36
3     d   23     37
4     e   20     38
5     f   19     39
6     g   23     40
7     h   22     41
8     i   22     42
9     j   22     43
10    k   22     44
11    l   22     45
12    m   22     46
13    n   22     47
14    o   22     48
15    p   22     49

In [40]:
type(df)

pandas.core.frame.DataFrame

In [42]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [44]:
df['Name']

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
Name: Name, dtype: object

In [45]:
df.head()

  Name  Age  Marks
0    a   22     34
1    b   23     35
2    c   21     36
3    d   23     37
4    e   20     38

In [46]:
df.tail()

   Name  Age  Marks
11    l   22     45
12    m   22     46
13    n   22     47
14    o   22     48
15    p   22     49

In [47]:
df.shape

(16, 3)

In [48]:
df.info

<bound method DataFrame.info of    Name  Age  Marks
0     a   22     34
1     b   23     35
2     c   21     36
3     d   23     37
4     e   20     38
5     f   19     39
6     g   23     40
7     h   22     41
8     i   22     42
9     j   22     43
10    k   22     44
11    l   22     45
12    m   22     46
13    n   22     47
14    o   22     48
15    p   22     49>

In [49]:
df.describe

<bound method NDFrame.describe of    Name  Age  Marks
0     a   22     34
1     b   23     35
2     c   21     36
3     d   23     37
4     e   20     38
5     f   19     39
6     g   23     40
7     h   22     41
8     i   22     42
9     j   22     43
10    k   22     44
11    l   22     45
12    m   22     46
13    n   22     47
14    o   22     48
15    p   22     49>

In [50]:
df[['Name','Marks']]

   Name  Marks
0     a     34
1     b     35
2     c     36
3     d     37
4     e     38
5     f     39
6     g     40
7     h     41
8     i     42
9     j     43
10    k     44
11    l     45
12    m     46
13    n     47
14    o     48
15    p     49

In [53]:
df.iloc[2]

Name      c
Age      21
Marks    36
Name: 2, dtype: object

In [61]:
df.iloc[1:5]

  Name  Age  Marks
1    b   23     35
2    c   21     36
3    d   23     37
4    e   20     38

In [62]:
df.head(3)

  Name  Age  Marks
0    a   22     34
1    b   23     35
2    c   21     36

In [64]:
df.tail(3)

   Name  Age  Marks
13    n   22     47
14    o   22     48
15    p   22     49

In [6]:
df['Total']= df['Age']+df['Marks']

In [7]:
df

   Name  Age  Marks  Total
0     a   22     34     56
1     b   23     35     58
2     c   21     36     57
3     d   23     37     60
4     e   20     38     58
5     f   19     39     58
6     g   23     40     63
7     h   22     41     63
8     i   22     42     64
9     j   22     43     65
10    k   22     44     66
11    l   22     45     67
12    m   22     46     68
13    n   22     47     69
14    o   22     48     70
15    p   22     49     71